# "Видатки державного бюджету України на управління зоною відчуження"
# Під час роботи програми з'являтимуться попередження. То не помилки
import pandas as pd
from datetime import datetime
import time
import random

# Створимо порожній датафрейм df
df = pd.DataFrame()
d_end = input(
    'Введіть початкову дату останнього місяця (подивитись який доступний останній місяць) в форматі "2023-04-01": ')
months = int(input('Введіть кількість місяців, за які хочете отримати дані: '))
months = months - 1
funds = ['COMMON', 'SPECIAL']  # Ми будемо брати дані з Загального і Спеціального фондів
categories = ['2708010', '2708070', '2708080', '2708090', '2708110', '2708120']  # Категорії, які нас цікавлять
# Перетворимо введену дату у формат datetime без часу
d_end = datetime.strptime(d_end, '%Y-%m-%d').date()
# Віднімемо від дати кількість місяців (pd.DateOffset(months=month))
d_start = d_end - pd.DateOffset(months=months)
# Перетворимо  в формат datetime без часу
d_start = d_start.date()
# Створимо список з датами початку кожного місяця
dates = pd.date_range(d_start, d_end, freq='MS').strftime("%Y-%m-%d").tolist()
# Пройдемось по списку дат
for date in dates:
    # Пройдемось по списку фондів
    for fund in funds:
        # відкриємо ексель таблицю за адресою f'https://openbudget.gov.ua/api/reports/expenses/program/XLSX?budgetType=NATIONAL&fundType={fund}&year={date[0:4]}&monthTo={int(date[5:7])}&monthFrom={int(date[5:7])}'
        c_df = pd.read_excel(
            f'https://openbudget.gov.ua/api/reports/expenses/program/XLSX?budgetType=NATIONAL&fundType={fund}&year={date[0:4]}&monthTo={int(date[5:7])}&monthFrom={int(date[5:7])}',
            engine='openpyxl', converters={'код': str})
        # Загальна сума витрат за цей період total_sum. Значення беремо з стовбчика "виконано за період" якщо в стовбику "найменування коду" значення "РАЗОМ"
        total_sum = c_df[c_df['найменування коду'] == 'РАЗОМ']['виконано за період'].values[0]
        # Додамо стовбчик "Дата початку періоду" зі значенням date в форматі datetime без часу
        c_df['Дата початку періоду'] = datetime.strptime(date, '%Y-%m-%d').date()
        # Додамо стовбчик "Дата кінця періоду" зі значенням останнього дня місяця date (використаємо MonthEnd). Результат перетворимо в формат datetime без часу
        c_df['Дата кінця періоду'] = (pd.to_datetime(date) + pd.offsets.MonthEnd(0)).date()
        # Додамо стовбчик "Місяць" зі значенням місяця date
        c_df['Місяць'] = int(date[5:7])
        # Додамо стовбчик "Код 2 рівня" і візьмемо зі значенням зі стовбчика "код" де замість останніх трьох символів буде два нулі (використаємо регулярні вирази)
        c_df['Код 2 рівня'] = c_df['код'].str.replace(r'\d{3}$', '000')
        # Додамо стовбчик "Код 1 рівня" і візьмемо зі значенням зі стовбчика "код" де замість останніх 4 символів буде чотири нулі (використаємо регулярні вирази)
        c_df['Код 1 рівня'] = c_df['код'].str.replace(r'\d{4}$', '0000')
        # Створимо словник c_dict з ключами "код" і значенням "найменування коду"
        c_dict = c_df.set_index('код')['найменування коду'].to_dict()
        # Додамо стовбчик "Назва 2 рівня", в якому значення буде взято зі словника c_dict за ключем "Код 2 рівня"
        c_df['Назва 2 рівня'] = c_df['Код 2 рівня'].map(c_dict)
        # Додамо стовбчик "Назва 1 рівня", в якому значення буде взято зі словника c_dict за ключем "Код 1 рівня"
        c_df['Назва 1 рівня'] = c_df['Код 1 рівня'].map(c_dict)
        # Додамо стовбчик "Частка від загальних видатків за звітний період, %" де буде результат математичної операції "виконано за період" поділити на total_sum помножене на 100
        c_df['Частка від загальних видатків за звітний період, %'] = c_df['виконано за період'] / total_sum * 100
        # Збережемо d c_df такі стовбчики:
        c_df = c_df[
            ['Дата початку періоду', 'Дата кінця періоду', 'Місяць', 'Код 1 рівня', 'Назва 1 рівня', 'Код 2 рівня',
             'Назва 2 рівня', 'код', 'найменування коду', 'тип фонду', 'початковий річний план',
             'уточнений річний план',
             'виконано за період', 'Частка від загальних видатків за звітний період, %']]
        # В датафреймі c_df залишимо лише ті рядки, в яуих в стовбчику "код" є значення зі списку categories
        c_df = c_df[c_df['код'].isin(categories)]
        # Додамо c_df до df
        df = pd.concat([df, c_df])
        # Пауза від 1 до 3 секунд
        time.sleep(random.randint(1, 3))
# Визначимо first_data як мінімальне значення зі стовбчика "Дата початку періоду"
first_date = df['Дата початку періоду'].min()
# Збережемо df в файл
df.to_excel('processing.xlsx', index=False)
